;---------------------------------BEGIN: EMCC\Caliset-----------------------------------------
[CALISET_DLG_102]
CAPTION=HL Calibrate Software
ID1022=Project collection
ID1023=Sel.:
ID1007=SaveAs
ID1017=Del.
ID1084=Import
ID1085=Export

ID1075=Head
ID1024=Base
ID1025=Cali.Range(mm):
ID1026=Mark.Range(mm):
ID1072=Coord.
ID1077=R.Angle
ID1079=Off.X(mm)
ID1080=Off.Y(mm)
ID1119=Galvanometer1=X
ID1120=Galvanometer2=X
ID1116=Reverse
ID1117=Reverse

ID1030=Level Cali(Select the zoom ratio and double-click to pop up the automatic calculation window)
ID1009=New Level
ID1010=Del.Level
ID1012=Test All
ID1031=TestLayer:
ID1018=Only Max Level Mark Text

ID1053=Red Cali.
ID1043=Used
ID1054=X Scale:
ID1055=Y Scale:
ID1056=X Offset(mm):
ID1057=Y Offset(mm):

ID1058=Focus
ID1065=Mirror Type:
ID1059=Type
ID1060=Ctrl Mode
ID1061=Mirr Dist(mm)
ID1082=Dist between head && worktable(mm)
ID1063=MicroAdjust(um)
ID1062=AutoFocus ratio

ID1011=Test F7
ID1037=Stop
ID1014=Para>>

ID1109=Cali Type
ID1099=Normal Cali
ID1100=Super Cali 1
ID1101=Super Cali
ID1110= Normal calibrate, adjust axis and box size
ID1114=Import CaliData

ID1089=Super Cali
ID1086=Mark Matrix
ID1111=First step: Mark Matrix
ID1112=Second step: Import cali data 
ID1113=Third step: Make super cali file

ID1096=Scale
ID1027=Effective mark range
ID1097=Concave
ID1028=Test Box range(mm):
ID1091=Import Data from scnner
ID1087=Import Data from vision measurement system 
ID1016=Make super cali file
ID1139=Generate correction table
ID1=Ok
ID2=Cancel
ID1142 = Marking control

[CALISET_DLG_167]
CAPTION=Import super cali data
ID1114=The file of X position：
ID1115=The file of Y position：
ID1=Ok
ID2=Cancel

[CALISET_DLG_159]
CAPTION=Save project
ID1036=The name of project is:
ID1=Ok
ID2=Cancel

[CALISET_DLG_131]
CAPTION=Marking Para
ID1032=Mark count:
ID1033=Mark V.(mm/s)
ID1034=Q Frequent(KHz)
ID1035=PowerCurrent
ID1036=Q Release(us)
ID1037=Laser off delay (us)

ID1=Ok
ID2=Cancel

[CALISET_DLG_160]
CAPTION=Set matrix mark
ID1093=Row
ID1094=Col
ID1116=Only Set
ID1=Ok
ID2=Cancel
ID1099=Point
ID1100=Cross
ID1101=Circle

[CALISET_DLG_164]
CAPTION=Select control card
ID1098=Please select working card:
ID1=Ok
ID2=Cancel

[CALISET_STRINGTABLE]
ID0=BOX size(mm)
ID1=X zoom%
ID2=Y zoom%
ID3=X conca
ID4=Y conca
ID5=X trape
ID6=Y trape
ID7=X paral
ID8=Y paral
ID9=X+ rate%
ID10=X- rate%
ID11=Y+ rate%
ID12=Y- rate%
ID13=Para\Level
ID14=Current(A)
ID15=Power(%)
ID16=Current(%)
ID17=Pulse(ns)
ID18=Mode
ID999=Marking softwar or calibrate has been start. Please close it first!
ID1000=Marking library file is missing or damaged, please make sure the software is proper!
ID1001=Initialize control board unsuccessfully!
ID1002=configuration of Marking control board is unsuccessful!
ID1003=Please select the level to be tested!
ID1004=Operation failed, retry!
ID1005=Existed project, overwrited?	
ID1006=Calibration range mustn't be zero0!	
ID1007=Marking range mustn't be zero!
ID1008=Wrong coefficient of proportionality, calibration range must bigger than %.3f times of marking!
ID1009=Apply
ID1010=Edit
ID1011=Please select the level to be deleted!
ID1012=Delete unsuccessfully! Please remain one level at least.
ID1013=File error!
ID1014=Set the calibration data to the card unsuccessfully, retry!!	
ID1015=Version is not consistent. Begin a mandatory read?
ID1016=BOX size overstep mark range!
ID1017=BOX size can not overstep upper pole size!
ID1018=The current calibration settings have been modified.Save it?
ID1019=Read file unsuccessfully!
ID1020=Are you sure to delete this project?
ID1021=No dongle found!
ID1022=dongle found, but it's invalid!
ID1023=More than 1 valid dongle inserted!
ID1024=Failed to convert initial dongle into running dongle!
ID1025="Software license expired. Please contact customer service personnel of Han's Laser to re-apply licensed patches matching (dongle ID=%s, check code=%s)."
ID1026="D160"
ID1027="D480"
ID1028="CO2_Strong"
ID1029="CO2_Tradition"
ID1030="Mark faily!"
ID1031=BOX size can not be less than next pole size!
ID1032=Out of valid calibration range!
ID1033="f-thea Back"
ID1034="Dynamic focusing"
ID1035="Normal Back"
ID1036="BOX size must be less than value of mark range subtract %d mm while general laser mode"
ID1037="Fail to get the DOG ID saving on the card. Please check whether card has been binded"
ID1038="Fail to Import"
ID1039="Import successfully"
ID1040="Fail to Export"
ID1041="Export successfully"
ID1042="Operate unsuccessfully"
ID1043="File mismatch,error file!"
ID1044="Back 3D"
ID1045="x-coordinate file path is null!"
ID1046="y-coordinate file path is null!"
ID1047="Dog ID in card  different from the ID at the dongle"
ID1048="Card ID in card is null or length error"


;---------------------------------End: EMCC\Caliset-----------------------------------------

[error]
1=Card not initialized or card not found!
2 = Reset failed!
3 = The card version is not right!
4 = Alarm!
6=Execution failed!
7=Status does not correspond!
16=Command timed out!
17=Command lost!
18=Interface call asynchronous!
19=Interface occupied by another program!
20=Z axis overrun or correction file corruption!
21=Parameter mismatch!
23=Memory allocation failed!
100 = Offline use!
101=Command aborted!
1001=Port 1
1002=Port 2
1003=Port 3
1004=Port 4
1005=Port 5
1006=Port 6
1007=Port 7
1008 = Laser input not ready
1009 = Laser input ready

[4]
1 = Laser overtemperature, please turn off the power!
2 = Laser high anti-alarm, please turn off the power!
3 = Laser MO abnormal, please turn off the power!
4 = The laser cover is open, please turn off the power and install the laser cover!
5 = The safety door is opened, please close it!
6 = The shutter is closed abnormally, please turn off the power and check the shutter!
7 = The shutter is not open abnormally, please turn off the power and check the shutter!
8 = The safety door is opened, marking is paused, please close the safety door to continue marking!
9 = Safety gate opened, marking aborted!
10= Laser system alarm, please turn off the power!
11= Laser supply voltage out of range, please turn off the power!
12= Laser power supply overvoltage alarm, please turn off the power and check the laser power!
13= Laser power supply undervoltage alarm, please turn off the power and check the laser power!
14= SPI laser overtemperature alarm, please turn off the power!
15= SPI laser ready amplifier overcurrent alarm, please turn off the power!
16= SPI laser power amplifier overcurrent alarm, please turn off the power!
17= SPI laser collimation laser alarm, please turn off the power!
18= SPI laser retention alarm, please turn off the power!
19= SPI laser power alarm, please turn off the power!
20= Laser unknown alarm, please turn off the power!
21= Laser power overcurrent alarm, please turn off the power!
22= Laser power overvoltage alarm, please turn off the power!
23= Laser power overtemperature alarm, please turn off the power and check the heat dissipation conditions!
24= The laser power is not turned on, please check the power supply.
30= Negative limit is encountered during movement, marking is aborted!
31= When a positive limit is encountered during movement, the marking is aborted!
32= Motor pulse out of range
33= Galvanometer DA out of range!
34= Platform X-axis Super Positive Limit!
35= Platform X-axis over-negative limit!
36= Platform Y-axis super positive limit!
37= Platform Y-axis over-negative limit!
38= Galvanometer square head is powered abnormally, please turn off the power and check!
54=Please switch to the 512 correction table!
55=Please switch to the 128 correction table!
100 = The safety gate is valid and open!

110 = Hit a negative limit!
111 = hit a positive limit!
112 = Hit the origin in motion!
500=Galvanometer warming up, please try again later!

[door]
1=The safety door is opened, please close the security door!
2=The safety door is opened, marking is paused, please close the safety door to continue marking!
3 = The security door is opened, marking is aborted!
4 = The safety door is closed, you can continue to mark!
5=The safety door is closed and the status is normal!
6=Negative limit is encountered during exercise, marking is aborted!
7 = The positive limit is encountered during the movement, and the marking is aborted! 
[usb]
1=EMCC card already connected
2=The EMCC card has been disconnected

[4101]
3=DA card 1 function and version information
4=DA card 1 version date information
5 = Elapsed time of DA card 1
7 = number of error frames for DA card 1
9 = DA card 1 countdown to the 4th bit error time
11 = DA card 1 countdown time for the 3rd bit error
13 = DA card 1 countdown the time of the 2nd bit error
15 = Time of last bit error on DA card 1

[4102]
4 = Number of out-of-code frames of DA card 1
6 = DA card 1 countdown the time of the 4th miss
8 = DA card 1 countdown the time of the 3rd missed code
10 = DA card 1 countdown the time of the second missing code
12 = DA card 1 last missed the time
14=DA card 1 galvanometer alarm information
15=DA card 1 galvanometer alarm off laser enable

[4103]
3=DA card 2 function and version information
4=DA card 2 version date information
5 = Elapsed time of DA card 2
7 = Number of error frames for DA card 2
9 = DA card 2 countdown time for the 4th bit error
11 = DA card 2 countdown time for the 3rd bit error
13 = DA card 2 countdown the time of the second bit error
15 = time of the last bit error on DA card 2

[4104]
4 = the number of out-of-code frames of DA card 2
6 = DA card 2 countdown the time of the 4th miss
8 = DA card 2 countdown the time of the third miss
10 = DA card 2 penultimate loss time
12 = the time when DA card 2 was last missed
14=DA card 2 galvanometer alarm information
15=DA card 2 galvanometer alarm off laser enable

[4105]
3=LASER card function and version information
4=LASER card version date information
5 = ELAPSED TIME OF THE LASER CARD
7 = THE NUMBER OF ERROR FRAMES FOR THE LASER CARD
9 = Time of the penultimate bit error of the LASER card
11 = Time of the penultimate bit error of the LASER card
13 = Time to count down to the 2nd bit error of the LASER card
15 = Time of the last bit error on the LASER card

[4106]
4 = THE NUMBER OF MISSED FRAMES OF THE LASER CARD
6 = The time when the LASER card loses its code for the 4th countdown
8 = The time when the LASER card loses the code for the 3rd countdown
10 = The time when the LASER card loses the code for the second penultimate time
12 = LASER card last missed code
14=LASER galvanometer alarm message
15=LASER card laser alarm off laser enable

[4107]
3=LASER card laser current ns waveform
4 = LASER card laser current ps waveform
5=LASER card laser current fs waveform
6 = LASER card laser currently maintains power

[4102Warning]
0=D0: DA card 1 data communication abnormal
1=D1: DA card 1 Scanner system alarm
2=D2: DA card 1 Scanner temperature alarm
3=D3: DA card 1 Scanner low speed alarm
4=D4: Not used
5=D5: Not used
6=D6: Not used
7=D7: Not used
8=D8: Not used
9=D9: Not used
10=D10: Not used
11=D11: Not used
12=D12: Not used
13=D13: Not used
14=D14: Not used
15=D15: EMCC card Data communication abnormal

[4104Warning]
0=D0: DA card 2 data communication abnormal
1=D1: DA Card 2 Scanner system alarm
2=D2: DA card 2 Scanner temperature alarm
3=D3: DA card 2 Scanner low-speed alarm
4=D4: Not used
5=D5: Not used
6=D6: Not used
7=D7: Not used
8=D8: Not used
9=D9: Not used
10=D10: Not used
11=D11: Not used
12=D12: Not used
13=D13: Not used
14=D14: Not used
15=D15: Not used

[4106Warning]
0=D0: LASER card data communication abnormal
1=D1: Laser temperature alarm
2=D2: Power alarm
3=D3: System alarm
4=D4: High anti-alarm
5=D5: The laser is not ready
6=D6: Seed laser ignition failed
7=D7: Seed laser temperature alarm
8=D8: MO overcurrent alarm
9=D9: PA overcurrent alarm
10=D10: Collimator alarm
11=D11: Hold alarm 5
12=D12: Hold alarm 4
13=D13: Hold alarm 3
14=D14: Hold alarm 2
15=D15: Hold alarm 1

[Refresh]
Interval=500


